# Pandas puzzles

Most the following exercises have been selected by UZH ZI & David Pinezich as part of the ZI APPD course. Inspired by [100 Numpy exerises](https://github.com/rougier/numpy-100), here is a short list of puzzles for testing your knowledge of [pandas'](http://pandas.pydata.org/) power. 

Since pandas is a large library with many different specialist features and functions, these excercises focus mainly on the fundamentals of manipulating data (indexing, grouping, aggregating), making use of the core DataFrame and Series objects. 

Many of the excerises here are stright-forward in that the solutions require no more than a few lines of code (in pandas or NumPy). Choosing the right methods and following best practices is the underlying goal.

If you're just starting out with pandas and you are looking for some other resources, the official documentation  is very extensive. In particular, some good places get a broader overview of pandas are...

- [10 minutes to pandas](http://pandas.pydata.org/pandas-docs/stable/10min.html)
- [pandas basics](http://pandas.pydata.org/pandas-docs/stable/basics.html)
- [tutorials](http://pandas.pydata.org/pandas-docs/stable/tutorials.html)
- [cookbook and idioms](http://pandas.pydata.org/pandas-docs/stable/cookbook.html#cookbook)

Enjoy!

## Importing pandas

### Getting started and checking your pandas setup

**1.** Import pandas under the name `pd`, and numpy under its alias `np`.

In [52]:
import pandas as pd

**2.** Print the version of pandas that has been imported.

In [53]:
pd.__version__

'2.3.3'

## DataFrame basics

### A few of the fundamental routines for selecting, sorting, adding and aggregating data in DataFrames

**3.** Load the data from `pd_puzzles.csv`. Assign the following list as indices: `['a', 'b', 'c', 'd', 'e', 'f', 'g', 'h', 'i', 'j']`.

In [54]:
df = pd.read_csv("pd_puzzles.csv")
df.index=['a', 'b', 'c', 'd', 'e', 'f', 'g', 'h', 'i', 'j']
df.head()

  animal  age  visits priority
a    cat  2.5       1      yes
b    cat  3.0       3      yes
c  snake  0.5       2       no
d    dog  NaN       3      yes
e    dog  5.0       2       no

**4.** Display the basic information about this DataFrame and its data.

In [55]:
df.info()

<class 'pandas.core.frame.DataFrame'>
Index: 10 entries, a to j
Data columns (total 4 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   animal    10 non-null     object
 1   age       8 non-null      float64
 2   visits    10 non-null     int64
 3   priority  10 non-null     object
dtypes: float64(1), int64(1), object(2)
memory usage: 400.0+ bytes

**5.** Display the summary statistics about the data in the df.

In [56]:
df.describe()

            age     visits
count  8.000000  10.000000
mean   3.437500   1.900000
std    2.007797   0.875595
min    0.500000   1.000000
25%    2.375000   1.000000
50%    3.000000   2.000000
75%    4.625000   2.750000
max    7.000000   3.000000

**6.** Select just the 'animal' and 'age' columns from the DataFrame `df`.

In [57]:
df[["animal", "age"]]

  animal  age
a    cat  2.5
b    cat  3.0
c  snake  0.5
d    dog  NaN
e    dog  5.0
f    cat  2.0
g  snake  4.5
h    cat  NaN
i    dog  7.0
j    dog  3.0

**7.** Select the data in rows `[3, 4, 8]` *and* in columns `['animal', 'age']`.
(**hint**: df.index)

In [58]:
df.iloc[[3, 4, 8]][['animal', 'age']]

  animal  age
d    dog  NaN
e    dog  5.0
i    dog  7.0

**8.** Select only the rows where the number of visits is greater than 2.

In [59]:
df[df["visits"] >= 2]

  animal  age  visits priority
b    cat  3.0       3      yes
c  snake  0.5       2       no
d    dog  NaN       3      yes
e    dog  5.0       2       no
f    cat  2.0       3       no
i    dog  7.0       2       no

**9.** Select the rows where the age is missing, i.e. is `NaN`.
(**hint**: isna)

In [60]:
df[df.age.isna()]

  animal  age  visits priority
d    dog  NaN       3      yes
h    cat  NaN       1      yes

**10.** Select the rows where the animal is a cat *and* the age is less than 3.

In [61]:
df[(df.animal == "cat") & (df.age < 3)]

  animal  age  visits priority
a    cat  2.5       1      yes
f    cat  2.0       3       no

**11.** Change the age of the cat in row 'd' to 5.5. (**hint**: You can use both implicit or explicit indices)

In [62]:
df.loc["d", ["animal", "age"]]

animal    dog
age       NaN
Name: d, dtype: object

**12.** Calculate the sum of all visits (the total number of visits).

In [63]:
print(df['visits'].sum())

19

**13.** Calculate the mean age for each different animal in `df`.

In [64]:
df.groupby('animal')["age"].mean()

animal
cat      2.5
dog      5.0
snake    2.5
Name: age, dtype: float64

**14.** Append a new column 'newcol' to `df` with your choice of values for each column. Then delete that column to return the original DataFrame.

In [65]:
df["newcol"] = df["age"] / df["visits"]
df

  animal  age  visits priority    newcol
a    cat  2.5       1      yes  2.500000
b    cat  3.0       3      yes  1.000000
c  snake  0.5       2       no  0.250000
d    dog  NaN       3      yes       NaN
e    dog  5.0       2       no  2.500000
f    cat  2.0       3       no  0.666667
g  snake  4.5       1       no  4.500000
h    cat  NaN       1      yes       NaN
i    dog  7.0       2       no  3.500000
j    dog  3.0       1       no  3.000000

In [66]:
df = df.drop(columns=["newcol"], axis = 1)
df

  animal  age  visits priority
a    cat  2.5       1      yes
b    cat  3.0       3      yes
c  snake  0.5       2       no
d    dog  NaN       3      yes
e    dog  5.0       2       no
f    cat  2.0       3       no
g  snake  4.5       1       no
h    cat  NaN       1      yes
i    dog  7.0       2       no
j    dog  3.0       1       no

**15.** Append a new row to `df` for a 5 y.o. parrot on his second visit with no priority. Then delete that row again to return to the original DataFrame.

In [67]:
df_parrot = pd.DataFrame([["parrot", 5.0, 2, "no"]], columns=df.columns, index=['k'])
df_parrot
df = pd.concat((df, df_parrot))
df

   animal  age  visits priority
a     cat  2.5       1      yes
b     cat  3.0       3      yes
c   snake  0.5       2       no
d     dog  NaN       3      yes
e     dog  5.0       2       no
f     cat  2.0       3       no
g   snake  4.5       1       no
h     cat  NaN       1      yes
i     dog  7.0       2       no
j     dog  3.0       1       no
k  parrot  5.0       2       no

In [68]:
df = df.drop('k')
df

  animal  age  visits priority
a    cat  2.5       1      yes
b    cat  3.0       3      yes
c  snake  0.5       2       no
d    dog  NaN       3      yes
e    dog  5.0       2       no
f    cat  2.0       3       no
g  snake  4.5       1       no
h    cat  NaN       1      yes
i    dog  7.0       2       no
j    dog  3.0       1       no

**16.** The 'priority' column contains the values 'yes' and 'no'. Replace this column with a column of boolean values: 'yes' should be `True` and 'no' should be `False`.

In [69]:
df['prio'] = df['priority'].map({'yes': True, 'no': False})
df

  animal  age  visits priority   prio
a    cat  2.5       1      yes   True
b    cat  3.0       3      yes   True
c  snake  0.5       2       no  False
d    dog  NaN       3      yes   True
e    dog  5.0       2       no  False
f    cat  2.0       3       no  False
g  snake  4.5       1       no  False
h    cat  NaN       1      yes   True
i    dog  7.0       2       no  False
j    dog  3.0       1       no  False

**17.** In the 'animal' column, change the 'snake' entries to 'python'.

In [70]:
df.loc[df["animal"] == "snake", "animal"] = "python"
df

   animal  age  visits priority   prio
a     cat  2.5       1      yes   True
b     cat  3.0       3      yes   True
c  python  0.5       2       no  False
d     dog  NaN       3      yes   True
e     dog  5.0       2       no  False
f     cat  2.0       3       no  False
g  python  4.5       1       no  False
h     cat  NaN       1      yes   True
i     dog  7.0       2       no  False
j     dog  3.0       1       no  False

**18.** Sort `df` first by the values in the 'age' in *decending* order, then by the value in the 'visit' column in *ascending* order.

In [71]:
df_sorted = df.sort_values("visits", ascending=True).sort_values("age", ascending=False) # ??
#or:
df_sorted = df.sort_values("age", ascending=False)
df_sorted

   animal  age  visits priority   prio
i     dog  7.0       2       no  False
e     dog  5.0       2       no  False
g  python  4.5       1       no  False
b     cat  3.0       3      yes   True
j     dog  3.0       1       no  False
a     cat  2.5       1      yes   True
f     cat  2.0       3       no  False
c  python  0.5       2       no  False
d     dog  NaN       3      yes   True
h     cat  NaN       1      yes   True

**19.** Create a copy of the animal column, delete all duplicated rows and add another column with the biological family (dogs = canidae, cats = felidae, python = pythonidea), then merge the copy with the original dataframe.

In [72]:
df_animals = df[["animal"]].copy()
df_animals = df_animals.drop_duplicates()

family_map = {'dog': 'canidae', 'cat': 'felidae', 'python': 'pythonidae'}
df_animals["biological_family"] = df_animals["animal"].map(family_map)
display(df_animals)

df_merged = pd.merge(df, df_animals, how='left', on='animal')
df_merged

   animal biological_family
a     cat           felidae
c  python        pythonidae
d     dog           canidae

   animal  age  visits priority   prio biological_family
0     cat  2.5       1      yes   True           felidae
1     cat  3.0       3      yes   True           felidae
2  python  0.5       2       no  False        pythonidae
3     dog  NaN       3      yes   True           canidae
4     dog  5.0       2       no  False           canidae
5     cat  2.0       3       no  False           felidae
6  python  4.5       1       no  False        pythonidae
7     cat  NaN       1      yes   True           felidae
8     dog  7.0       2       no  False           canidae
9     dog  3.0       1       no  False           canidae

**20.** For each animal type and each number of visits, find the mean age. In other words, each row is an animal, each column is a number of visits and the values are the mean ages (hint: use a pivot table).

In [73]:
df.pivot_table(index='animal', columns='visits', values='age', aggfunc='mean')

visits    1    2    3
animal
cat     2.5  NaN  2.5
dog     3.0  6.0  NaN
python  4.5  0.5  NaN

**21.** Given a DataFrame of numeric values, say
```python
df2 = pd.DataFrame(np.random.random(size=(5, 3))) # a 5x3 frame of float values
```

how do you subtract the row mean from each element in the row?

In [74]:
import numpy as np
np.random.seed(42)

df2 = pd.DataFrame(np.random.random(size=(5, 3))) # a 5x3 frame of float values
df2

          0         1         2
0  0.374540  0.950714  0.731994
1  0.598658  0.156019  0.155995
2  0.058084  0.866176  0.601115
3  0.708073  0.020584  0.969910
4  0.832443  0.212339  0.181825

In [75]:
df2.mean(axis=1)

0    0.685749
1    0.303557
2    0.508458
3    0.566189
4    0.408869
dtype: float64

In [76]:
df2 = df2.sub(df2.mean(axis=1), axis=0)
df2

          0         1         2
0 -0.311209  0.264965  0.046244
1  0.295101 -0.147539 -0.147563
2 -0.450375  0.357718  0.092657
3  0.141884 -0.545604  0.403721
4  0.423574 -0.196530 -0.227044

**22.** Suppose you have DataFrame with 10 columns of real numbers, for example:

```python
df2 = pd.DataFrame(np.random.random(size=(5, 10)), columns=list('abcdefghij'))
```
Which column of numbers has the smallest sum? (Find that column's label.)

In [77]:
df3 = pd.DataFrame(np.random.random(size=(5, 10)), columns=list('abcdefghij'))
df3

,a,b,c,d,e,f,g,h,i,j
0,0.183405,0.304242,0.524756,0.431945,0.291229,0.611853,0.139494,0.292145,0.366362,0.456070
1,0.785176,0.199674,0.514234,0.592415,0.046450,0.607545,0.170524,0.065052,0.948886,0.965632
2,0.808397,0.304614,0.097672,0.684233,0.440152,0.122038,0.495177,0.034389,0.909320,0.258780
3,0.662522,0.311711,0.520068,0.546710,0.184854,0.969585,0.775133,0.939499,0.894827,0.597900
4,0.921874,0.088493,0.195983,0.045227,0.325330,0.388677,0.271349,0.828738,0.356753,0.280935

In [78]:
df3.sum(axis=0).idxmin()

'b'

**23.** How do you count how many unique rows a DataFrame has (i.e. ignore all rows that are duplicates)? What about unique entries in each columns?

Use the follwing dataframe:
```python
df_3 = pd.DataFrame({
    "A": [1, 1, 2, 2, 3, 3, 3],
    "B": [10, 10, 20, 20, 30, 31, 30],
    "C": ["x", "x", "y", "y", "z", "z", "z"]
})
```

In [79]:
df_4 = pd.DataFrame({
    "A": [1, 1, 2, 2, 3, 3, 3],
    "B": [10, 10, 20, 20, 30, 31, 30],
    "C": ["x", "x", "y", "y", "z", "z", "z"]
})
df_4

   A   B  C
0  1  10  x
1  1  10  x
2  2  20  y
3  2  20  y
4  3  30  z
5  3  31  z
6  3  30  z

In [80]:
df_4.drop_duplicates().shape[0]

4

In [81]:
df_4.nunique()

A    3
B    4
C    3
dtype: int64